{"data":[{"alignmentgroup":"True","customdata":[["Curcuma longa","India","India","1","Andaman Is., Assam, Bangladesh, Belize, Borneo, Cambodia, Caroline Is., China South-Central, China Southeast, Comoros, Congo, Cook Is., Costa Rica, Cuba, Dominican Republic, East Himalaya, Easter Is., Fiji, Gilbert Is., Guinea-Bissau, Gulf of Guinea Is., Haiti, Hawaii, Ivory Coast, Jawa, Leeward Is., Lesser Sunda Is., Malaya, Marquesas, Mauritius, Myanmar, New Caledonia, New Guinea, Nicobar Is., Philippines, Pitcairn Is., Puerto Rico, Queensland, Réunion, Samoa, Society Is., Solomon Is., Sri Lanka, Sumatera, Taiwan, Thailand, Tibet, Tonga, Trinidad-Tobago, Tuamotu, Tubuai Is., Vietnam, Windward Is.","53"],["Zingiber officinale","South East Asia; India (secondary)","Assam, China South-Central, East Himalaya, India","4","Andaman Is., Bangladesh, Borneo, Cambodia, Caroline Is., China Southeast, Comoros, Costa Rica, Cuba, Dominican Republic, Gulf of Guinea Is., Hainan, Haiti, Honduras, Leeward Is., Lesser Sunda Is., Madagascar, Malaya, Mauritius, Mexico Southwest, Myanmar, New Guinea, Nicobar Is., Philippines, Puerto Rico, Queensland, Rodrigues, Réunion, Solomon Is., Sri Lanka, Taiwan, Thailand, Trinidad-Tobago, Vietnam, Windward Is.","35"],["Elettaria cardamomum","India","India, the Western Ghats","2","Bangladesh, Cambodia, Costa Rica, Lesser Sunda Is., Réunion, Thailand, Trinidad-Tobago","7"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Zingiberaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["turmeric","ginger","cardamom"],"legendgroup":"Zingiberaceae","marker":{"color":"#5f4690","pattern":{"shape":""}},"name":"Zingiberaceae","offsetgroup":"Zingiberaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["turmeric","ginger","cardamom"],"xaxis":"x","y":[53.0,8.75,3.5],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Piper nigrum","Malabar coast (South India)","India","1","Andaman Is., Assam, Bangladesh, Benin, Cambodia, Cameroon, Caroline Is., China South-Central, China Southeast, Comoros, Cook Is., Costa Rica, Cuba, Dominican Republic, East Himalaya, Ethiopia, French Guiana, Guinea, Gulf of Guinea Is., Haiti, Honduras, Laos, Leeward Is., Marianas, Mauritius, Mexico Gulf, Nicobar Is., Philippines, Puerto Rico, Réunion, Seychelles, Sri Lanka, Thailand, Trinidad-Tobago, Venezuela, Vietnam, Windward Is.","37"],["Piper longum","E. Himalaya to S. China; Indo-China","Assam, Bangladesh, Cambodia, China South-Central, East Himalaya, Laos, Myanmar, Nicobar Is., Thailand, Vietnam","10","China Southeast, Hainan, India, Malaya, Nepal, Philippines, Sri Lanka","7"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Piperaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["pepper","long pepper"],"legendgroup":"Piperaceae","marker":{"color":"#1d6996","pattern":{"shape":""}},"name":"Piperaceae","offsetgroup":"Piperaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["pepper","long pepper"],"xaxis":"x","y":[37.0,0.7],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Cinnamomum verum","Sri Lanka; SW. India","Sri Lanka","1","Argentina Northeast, Assam, Bangladesh, Borneo, Brazil Southeast, Cambodia, Caroline Is., China Southeast, Comoros, Cook Is., Fiji, Gulf of Guinea Is., Hawaii, India, Jawa, Leeward Is., Mauritius, Myanmar, Philippines, Samoa, Seychelles, Society Is., Taiwan, Tanzania, Vietnam, Windward Is.","26"],["Cinnamomum cassia","Southeast China","China Southeast","1","Bangladesh, Cambodia, China South-Central, Guatemala, Hainan, Honduras, India, Laos, Malaya, Myanmar, Sumatera, Taiwan, Thailand, Trinidad-Tobago, Vietnam","15"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Lauraceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["cinnamon","cassia"],"legendgroup":"Lauraceae","marker":{"color":"#38a6a5","pattern":{"shape":""}},"name":"Lauraceae","offsetgroup":"Lauraceae","orientation":"v","showlegend":true,"textposition":"auto","x":["cinnamon","cassia"],"xaxis":"x","y":[26.0,15.0],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Capsicum annuum","Central America","Guatemala, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest","7","Alabama, Aldabra, Algeria, Andaman Is., Angola, Assam, Austria, Bahamas, Bangladesh, Belize, Benin, Bismarck Archipelago, Bolivia, Borneo, Botswana, Brazil North, Brazil Northeast, Bulgaria, Burundi, Cambodia, Cameroon, Canary Is., Cape Verde, Caroline Is., Cayman Is., Central African Repu, Chad, Colombia, Comoros, Congo, Cook Is., Costa Rica, Cuba, Djibouti, Dominican Republic, East Himalaya, Ecuador, El Salvador, Equatorial Guinea, Eritrea, Ethiopia, Fiji, Gabon, Galápagos, Gambia, Ghana, Gilbert Is., Greece, Guinea-Bissau, Gulf of Guinea Is., Guyana, Haiti, Honduras, India, Ivory Coast, Jawa, Kazakhstan, Kazan-retto, Kenya, Korea, Laos, Leeward Is., Line Is., Madagascar, Madeira, Maldives, Mali, Marianas, Marquesas, Marshall Is., Mauritius, Morocco, Myanmar, Nepal, New Guinea, New South Wales, New York, Nicobar Is., Niger, Nigeria, Northern Provinces, Northern Territory, Oman, Pakistan, Panamá, Peru, Philippines, Puerto Rico, Queensland, Rodrigues, Réunion, Senegal, Sierra Leone, Society Is., Solomon Is., Somalia, Southwest Caribbean, Sri Lanka, Sulawesi, Suriname, Tadzhikistan, Tanzania, Togo, Trinidad-Tobago, Tuamotu, Tunisia, Turkey, Turkmenistan, Turks-Caicos Is., Uganda, Uzbekistan, Vanuatu, Venezuela, Vietnam, Wake I., West Himalaya, Windward Is., Zambia, Zaïre, Zimbabwe","120"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Solanaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["chile"],"legendgroup":"Solanaceae","marker":{"color":"#0f8554","pattern":{"shape":""}},"name":"Solanaceae","offsetgroup":"Solanaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["chile"],"xaxis":"x","y":[17.142857142857142],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Trigonella foenum-graecum","S Eur; W As","Afghanistan, Iran, Iraq, Pakistan","4","Albania, Algeria, Assam, Austria, Baltic States, Bangladesh, Belgium, Bulgaria, Central European Rus, China North-Central, China South-Central, Cyprus, Czechoslovakia, East Aegean Is., East European Russia, Ethiopia, Fiji, France, Germany, Greece, Hungary, India, Inner Mongolia, Italy, Kenya, Kirgizstan, Kriti, Krym, Kuwait, Lebanon-Syria, Libya, Mali, Manchuria, Morocco, Mozambique, Myanmar, Nepal, North Caucasus, North European Russi, Northern Provinces, Northwest European R, Oman, Palestine, Portugal, Qinghai, Romania, Saudi Arabia, Sicilia, Sinai, South European Russi, Spain, Sudan, Switzerland, Tadzhikistan, Tanzania, Tibet, Transcaucasus, Tunisia, Turkey, Turkey-in-Europe, Turkmenistan, Ukraine, Uzbekistan, West Himalaya, Xinjiang, Yemen, Yugoslavia, Zimbabwe","68"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Fabaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["fenugreek"],"legendgroup":"Fabaceae","marker":{"color":"#73af48","pattern":{"shape":""}},"name":"Fabaceae","offsetgroup":"Fabaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["fenugreek"],"xaxis":"x","y":[17.0],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Coriandrum sativum","Mediterranean; W. Asia; India; SW As","Afghanistan, Iran, Lebanon-Syria, North Caucasus, Pakistan, Palestine, Saudi Arabia, Sinai, Transcaucasus, Turkey","10","Algeria, Amur, Andaman Is., Angola, Argentina Northeast, Argentina Northwest, Argentina South, Arizona, Assam, Austria, Azores, Baltic States, Bangladesh, Belarus, Belgium, Borneo, Brazil South, Bulgaria, California, Cambodia, Cameroon, Canary Is., Cape Provinces, Cape Verde, Central European Rus, Chad, China North-Central, China South-Central, China Southeast, Colombia, Connecticut, Costa Rica, Cuba, Cyprus, Czechoslovakia, Delaware, Denmark, Dominican Republic, East European Russia, East Himalaya, Ecuador, Egypt, El Salvador, Eritrea, Ethiopia, Fiji, Finland, Florida, France, Free State, Germany, Great Britain, Greece, Guatemala, Haiti, Hawaii, Hungary, Illinois, India, Iraq, Italy, Japan, Jawa, Juan Fernández Is., Kazakhstan, Kenya, Khabarovsk, Korea, Kriti, Krym, KwaZulu-Natal, Laos, Lesser Sunda Is., Libya, Louisiana, Madeira, Malaya, Maluku, Maryland, Massachusetts, Mauritius, Mexico Central, Mexico Northwest, Michigan, Missouri, Mongolia, Montana, Morocco, Mozambique, Nepal, Nevada, New Guinea, New Jersey, New Mexico, New York, New Zealand North, New Zealand South, Nicobar Is., Norfolk Is., North Carolina, North Dakota, Northern Provinces, Norway, Nova Scotia, Ohio, Oklahoma, Ontario, Oregon, Paraguay, Pennsylvania, Peru, Philippines, Poland, Portugal, Primorye, Puerto Rico, Québec, Rhode I., Rodrigues, Romania, Réunion, Sicilia, Somalia, South Carolina, South Dakota, South European Russi, Spain, Sri Lanka, Sudan, Sulawesi, Sumatera, Sweden, Switzerland, Tadzhikistan, Tanzania, Texas, Thailand, Trinidad-Tobago, Tunisia, Turkey-in-Europe, Turkmenistan, Uganda, Ukraine, Uzbekistan, Vietnam, Virginia, Washington, West Siberia, Yugoslavia, Zimbabwe","150"],["Anethum graveolens","Nort Africa; West Asia","Algeria, Chad, Cyprus, Gulf States, Iran, Lebanon-Syria, Libya, Morocco, Oman, Saudi Arabia, Tunisia","11","Afghanistan, Alabama, Albania, Alberta, Altay, Andaman Is., Angola, Argentina Northeast, Arizona, Arkansas, Assam, Austria, Azores, Bahamas, Baleares, Baltic States, Bangladesh, Belarus, Belgium, Brazil South, Brazil Southeast, British Columbia, Bulgaria, California, Cameroon, Canary Is., Cape Verde, Cayman Is., Central European Rus, China North-Central, China South-Central, China Southeast, Connecticut, Costa Rica, Cuba, Czechoslovakia, Delaware, Denmark, Dominican Republic, East Aegean Is., East European Russia, East Himalaya, Ecuador, Eritrea, Ethiopia, Finland, France, Ghana, Great Britain, Greece, Guatemala, Haiti, Hawaii, Hungary, Illinois, India, Indiana, Iowa, Iraq, Italy, Jamaica, Kansas, Kazakhstan, Kentucky, Kenya, Kriti, Krym, Laos, Leeward Is., Louisiana, Madeira, Maine, Manitoba, Maryland, Massachusetts, Michigan, Minnesota, Missouri, Mongolia, Montana, Mozambique, Nebraska, Nepal, Netherlands, New Jersey, New York, Nicobar Is., Niger, Nigeria, North Carolina, North Dakota, Northwest European R, Norway, Ohio, Oklahoma, Ontario, Oregon, Pakistan, Palestine, Pennsylvania, Peru, Portugal, Primorye, Puerto Rico, Québec, Rhode I., Romania, Saskatchewan, Sicilia, Somalia, South Dakota, South European Russi, Spain, Sudan, Sweden, Switzerland, Tadzhikistan, Tanzania, Texas, Thailand, Transcaucasus, Trinidad-Tobago, Turkey, Turkey-in-Europe, Ukraine, Uzbekistan, Vietnam, Virginia, Wake I., Washington, West Virginia, Windward Is., Wisconsin, Yugoslavia","134"],["Pimpinella anisum","E. Mediterranean; W. Asia","Cyprus, Lebanon-Syria, Palestine, Turkey","4","Argentina Northeast, Argentina Northwest, Austria, Bangladesh, Belarus, Brazil South, Bulgaria, Czechoslovakia, Denmark, East Aegean Is., France, Germany, Greece, Guatemala, Hungary, India, Iraq, Italy, Kazakhstan, Kriti, Laos, Leeward Is., Massachusetts, Michigan, Morocco, Norway, Oman, Poland, Portugal, Romania, South European Russi, Spain, Sweden, Tadzhikistan, Trinidad-Tobago, Tunisia, Turkmenistan, Ukraine, Uzbekistan, Venezuela, Xinjiang, Yugoslavia","42"],["Cuminum cyminum","W. \\& C. Asia; India ","Afghanistan, Iran, Iraq","3","Algeria, Andaman Is., Bangladesh, Benin, Bulgaria, East Himalaya, Eritrea, France, India, Kazakhstan, Laos, Lebanon-Syria, Libya, Massachusetts, Mexico Northeast, Morocco, Nicobar Is., Pakistan, Saudi Arabia, Sicilia, Spain, Texas, Transcaucasus, Tunisia, Uzbekistan, Xinjiang","26"],["Foeniculum vulgare","Med","Afghanistan, Albania, Algeria, Azores, Baleares, Bulgaria, Canary Is., Cape Verde, Corse, Cyprus, East Aegean Is., Egypt, Eritrea, Ethiopia, France, Greece, Gulf States, Iran, Iraq, Italy, Kriti, Lebanon-Syria, Libya, Madeira, Morocco, Nepal, North Caucasus, Pakistan, Palestine, Portugal, Sardegna, Saudi Arabia, Sicilia, Sinai, Spain, Tadzhikistan, Transcaucasus, Tunisia, Turkey, Turkey-in-Europe, Turkmenistan, Uzbekistan, West Himalaya, Yemen, Yugoslavia","45","Alberta, Amsterdam-St.Paul Is, Angola, Argentina Northeast, Argentina Northwest, Argentina South, Arizona, Assam, Austria, Bahamas, Bangladesh, Belgium, Bermuda, Brazil South, Brazil Southeast, British Columbia, California, Cape Provinces, Central European Rus, Chile Central, Chile North, Chile South, China North-Central, China South-Central, China Southeast, Colombia, Connecticut, Costa Rica, Cuba, Czechoslovakia, Delaware, Denmark, Djibouti, Dominican Republic, East Himalaya, Ecuador, El Salvador, Fiji, Finland, Florida, Georgia, Germany, Great Britain, Guatemala, Gulf of Guinea Is., Haiti, Hawaii, Hungary, Illinois, India, Iowa, Ireland, Jamaica, Jawa, Juan Fernández Is., Kansas, Kazakhstan, Kentucky, Kenya, Korea, Krym, KwaZulu-Natal, Leeward Is., Lesotho, Louisiana, Maine, Marianas, Maryland, Massachusetts, Mauritius, Mexico Northwest, Michigan, Mississippi, Missouri, Mongolia, Mozambique, Myanmar, Nebraska, Netherlands, Nevada, New Jersey, New Mexico, New York, New Zealand North, New Zealand South, Niue, Norfolk Is., North Carolina, Northern Provinces, Norway, Ohio, Ontario, Oregon, Paraguay, Pennsylvania, Peru, Poland, Puerto Rico, Québec, Rhode I., Rodrigues, Romania, Réunion, Society Is., Somalia, South Carolina, South European Russi, St.Helena, Sudan, Sweden, Switzerland, Tanzania, Tennessee, Texas, Thailand, Ukraine, Uruguay, Utah, Vietnam, Virginia, Washington, West Virginia, Windward Is., Wisconsin, Zimbabwe","125"],["Carum carvi","Mediterranean; Eurasia","Afghanistan, Albania, Altay, Amur, Austria, Baltic States, Bangladesh, Belarus, Belgium, Bulgaria, Buryatiya, Central European Rus, China North-Central, China South-Central, Chita, Czechoslovakia, Denmark, East European Russia, East Himalaya, Finland, France, Germany, Hungary, India, Inner Mongolia, Iran, Iraq, Irkutsk, Italy, Kamchatka, Kazakhstan, Khabarovsk, Kirgizstan, Krasnoyarsk, Krym, Kuril Is., Manchuria, Mongolia, Nepal, Netherlands, North Caucasus, North European Russi, Northwest European R, Norway, Pakistan, Poland, Primorye, Qinghai, Romania, Sakhalin, South European Russi, Spain, Sweden, Switzerland, Tadzhikistan, Tibet, Transcaucasus, Turkey, Turkmenistan, Tuva, Ukraine, Uzbekistan, West Himalaya, West Siberia, Xinjiang, Yakutskiya, Yugoslavia","67","Alberta, Algeria, British Columbia, Colorado, Connecticut, Cyprus, District of Columbia, Føroyar, Great Britain, Greenland, Iceland, Idaho, Illinois, Indiana, Iowa, Ireland, Kentucky, Labrador, Libya, Louisiana, Maine, Manitoba, Maryland, Massachusetts, Michigan, Minnesota, Missouri, Montana, Morocco, New Brunswick, New Hampshire, New Jersey, New Mexico, New York, Newfoundland, North Carolina, North Dakota, Nova Scotia, Nunavut, Ohio, Ontario, Oregon, Pennsylvania, Prince Edward I., Québec, Rhode I., Saskatchewan, South Dakota, South Georgia, Tunisia, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming","57"],["Ferula foetida","Iran; W. and C. Asia","Afghanistan, Iran, Kazakhstan, Kirgizstan, Pakistan, Tadzhikistan, Turkmenistan, Uzbekistan","8",null,"1"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Apiaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["coriander","dill","anise","cumin","fennel","caraway","asafoetida"],"legendgroup":"Apiaceae","marker":{"color":"#edad08","pattern":{"shape":""}},"name":"Apiaceae","offsetgroup":"Apiaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["coriander","dill","anise","cumin","fennel","caraway","asafoetida"],"xaxis":"x","y":[15.0,12.181818181818182,10.5,8.666666666666666,2.7777777777777777,0.8507462686567164,0.125],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Myristica fragrans","Moluccas (Indonesia)","Maluku","1","Assam, Bangladesh, China South-Central, China Southeast, Comoros, Gulf of Guinea Is., Jawa, Laos, Mauritius, Philippines, Réunion, Taiwan, Thailand, Vietnam","14"],["Myristica fragrans","Moluccas (Indonesia)","Maluku","1","Assam, Bangladesh, China South-Central, China Southeast, Comoros, Gulf of Guinea Is., Jawa, Laos, Mauritius, Philippines, Réunion, Taiwan, Thailand, Vietnam","14"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Myristicaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["mace","nutmeg"],"legendgroup":"Myristicaceae","marker":{"color":"#e17c05","pattern":{"shape":""}},"name":"Myristicaceae","offsetgroup":"Myristicaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["mace","nutmeg"],"xaxis":"x","y":[14.0,14.0],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Syzygium aromaticum","Moluccas (Indonesia)","Maluku","1","Borneo, Caroline Is., Comoros, Gulf of Guinea Is., Madagascar, Nicobar Is., Seychelles, Tanzania, Trinidad-Tobago","9"],["Pimenta dioica","S. Mexico to C. America; Caribbean","Bahamas, Belize, Cayman Is., Costa Rica, Cuba, Dominican Republic, Guatemala, Honduras, Jamaica, Mexico Gulf, Mexico Southeast, Mexico Southwest, Nicaragua","13","Bermuda, Caroline Is., Colombia, El Salvador, Florida, Hawaii, Puerto Rico, Society Is., Southwest Caribbean, Trinidad-Tobago, Venezuela","11"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Myrtaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["clove","allspice"],"legendgroup":"Myrtaceae","marker":{"color":"#cc503e","pattern":{"shape":""}},"name":"Myrtaceae","offsetgroup":"Myrtaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["clove","allspice"],"xaxis":"x","y":[9.0,0.8461538461538461],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Crocus sativus","Greece","Greece","1","Czechoslovakia, Iran, Italy, Morocco, Pakistan, Spain, Turkey, West Himalaya","8"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Iridaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["saffron"],"legendgroup":"Iridaceae","marker":{"color":"#94346e","pattern":{"shape":""}},"name":"Iridaceae","offsetgroup":"Iridaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["saffron"],"xaxis":"x","y":[8.0],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Vanilla planifolia","Tropical America","Belize, Brazil North, Brazil Northeast, Brazil Southeast, Colombia, Costa Rica, El Salvador, Guatemala, Honduras, Mexico Gulf, Mexico Southeast, Mexico Southwest, Nicaragua, Panamá","14","Bangladesh, Brazil West-Central, Caroline Is., Cayman Is., Chagos Archipelago, Comoros, Cook Is., Dominican Republic, Ecuador, Florida, French Guiana, Gulf of Guinea Is., Guyana, Jamaica, Jawa, Leeward Is., Lesser Sunda Is., Madagascar, Malaya, Marianas, Marquesas, New Caledonia, New Guinea, Niue, Paraguay, Peru, Puerto Rico, Réunion, Seychelles, Society Is., Suriname, Tonga, Trinidad-Tobago, Tuamotu, Venezuela, Windward Is., Zaïre","37"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Orchidaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["vanilla"],"legendgroup":"Orchidaceae","marker":{"color":"#6f4070","pattern":{"shape":""}},"name":"Orchidaceae","offsetgroup":"Orchidaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["vanilla"],"xaxis":"x","y":[2.642857142857143],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Illicium verum","SE. China; Vietnam","China Southeast, Vietnam","2","Cambodia, China South-Central","2"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Schisandraceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["star anise"],"legendgroup":"Schisandraceae","marker":{"color":"#808080","pattern":{"shape":""}},"name":"Schisandraceae","offsetgroup":"Schisandraceae","orientation":"v","showlegend":true,"textposition":"auto","x":["star anise"],"xaxis":"x","y":[1.0],"yaxis":"y","type":"bar"},{"alignmentgroup":"True","customdata":[["Zanthoxylum bungeanum","China","China North-Central, China South-Central, China Southeast, East Himalaya, Inner Mongolia, Manchuria, Nepal, Qinghai, Tibet, Xinjiang","10","Uzbekistan","1"]],"hovertemplate":"<b>%{hovertext}</b><br><br>family=Rutaceae<br>id=%{x}<br>spreadability=%{y}<br>species=%{customdata[0]}<br>region of origin=%{customdata[1]}<br>no. of native regions=%{customdata[3]}<br>no. of introduced regions=%{customdata[5]}<extra></extra>","hovertext":["Sichuan pepper"],"legendgroup":"Rutaceae","marker":{"color":"#000000","pattern":{"shape":""}},"name":"Rutaceae","offsetgroup":"Rutaceae","orientation":"v","showlegend":true,"textposition":"auto","x":["Sichuan pepper"],"xaxis":"x","y":[0.1],"yaxis":"y","type":"bar"}],"layout":{"template":{"data":{"barpolar":[{"marker":{"line":{"color":"white","width":0.5},"pattern":{"fillmode":"overlay","size":10,"solidity":0.2}},"type":"barpolar"}],"bar":[{"error_x":{"color":"#2a3f5f"},"error_y":{"color":"#2a3f5f"},"marker":{"line":{"color":"white","width":0.5},"pattern":{"fillmode":"overlay","size":10,"solidity":0.2}},"type":"bar"}],"carpet":[{"aaxis":{"endlinecolor":"#2a3f5f","gridcolor":"#C8D4E3","linecolor":"#C8D4E3","minorgridcolor":"#C8D4E3","startlinecolor":"#2a3f5f"},"baxis":{"endlinecolor":"#2a3f5f","gridcolor":"#C8D4E3","linecolor":"#C8D4E3","minorgridcolor":"#C8D4E3","startlinecolor":"#2a3f5f"},"type":"carpet"}],"choropleth":[{"colorbar":{"outlinewidth":0,"ticks":""},"type":"choropleth"}],"contourcarpet":[{"colorbar":{"outlinewidth":0,"ticks":""},"type":"contourcarpet"}],"contour":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"contour"}],"heatmapgl":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"heatmapgl"}],"heatmap":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"heatmap"}],"histogram2dcontour":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"histogram2dcontour"}],"histogram2d":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"histogram2d"}],"histogram":[{"marker":{"pattern":{"fillmode":"overlay","size":10,"solidity":0.2}},"type":"histogram"}],"mesh3d":[{"colorbar":{"outlinewidth":0,"ticks":""},"type":"mesh3d"}],"parcoords":[{"line":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"parcoords"}],"pie":[{"automargin":true,"type":"pie"}],"scatter3d":[{"line":{"colorbar":{"outlinewidth":0,"ticks":""}},"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scatter3d"}],"scattercarpet":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scattercarpet"}],"scattergeo":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scattergeo"}],"scattergl":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scattergl"}],"scattermapbox":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scattermapbox"}],"scatterpolargl":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scatterpolargl"}],"scatterpolar":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scatterpolar"}],"scatter":[{"fillpattern":{"fillmode":"overlay","size":10,"solidity":0.2},"type":"scatter"}],"scatterternary":[{"marker":{"colorbar":{"outlinewidth":0,"ticks":""}},"type":"scatterternary"}],"surface":[{"colorbar":{"outlinewidth":0,"ticks":""},"colorscale":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"type":"surface"}],"table":[{"cells":{"fill":{"color":"#EBF0F8"},"line":{"color":"white"}},"header":{"fill":{"color":"#C8D4E3"},"line":{"color":"white"}},"type":"table"}]},"layout":{"annotationdefaults":{"arrowcolor":"#2a3f5f","arrowhead":0,"arrowwidth":1},"autotypenumbers":"strict","coloraxis":{"colorbar":{"outlinewidth":0,"ticks":""}},"colorscale":{"diverging":[[0,"#8e0152"],[0.1,"#c51b7d"],[0.2,"#de77ae"],[0.3,"#f1b6da"],[0.4,"#fde0ef"],[0.5,"#f7f7f7"],[0.6,"#e6f5d0"],[0.7,"#b8e186"],[0.8,"#7fbc41"],[0.9,"#4d9221"],[1,"#276419"]],"sequential":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]],"sequentialminus":[[0.0,"#0d0887"],[0.1111111111111111,"#46039f"],[0.2222222222222222,"#7201a8"],[0.3333333333333333,"#9c179e"],[0.4444444444444444,"#bd3786"],[0.5555555555555556,"#d8576b"],[0.6666666666666666,"#ed7953"],[0.7777777777777778,"#fb9f3a"],[0.8888888888888888,"#fdca26"],[1.0,"#f0f921"]]},"colorway":["#636efa","#EF553B","#00cc96","#ab63fa","#FFA15A","#19d3f3","#FF6692","#B6E880","#FF97FF","#FECB52"],"font":{"color":"#2a3f5f"},"geo":{"bgcolor":"white","lakecolor":"white","landcolor":"white","showlakes":true,"showland":true,"subunitcolor":"#C8D4E3"},"hoverlabel":{"align":"left"},"hovermode":"closest","mapbox":{"style":"light"},"paper_bgcolor":"white","plot_bgcolor":"white","polar":{"angularaxis":{"gridcolor":"#EBF0F8","linecolor":"#EBF0F8","ticks":""},"bgcolor":"white","radialaxis":{"gridcolor":"#EBF0F8","linecolor":"#EBF0F8","ticks":""}},"scene":{"xaxis":{"backgroundcolor":"white","gridcolor":"#DFE8F3","gridwidth":2,"linecolor":"#EBF0F8","showbackground":true,"ticks":"","zerolinecolor":"#EBF0F8"},"yaxis":{"backgroundcolor":"white","gridcolor":"#DFE8F3","gridwidth":2,"linecolor":"#EBF0F8","showbackground":true,"ticks":"","zerolinecolor":"#EBF0F8"},"zaxis":{"backgroundcolor":"white","gridcolor":"#DFE8F3","gridwidth":2,"linecolor":"#EBF0F8","showbackground":true,"ticks":"","zerolinecolor":"#EBF0F8"}},"shapedefaults":{"line":{"color":"#2a3f5f"}},"ternary":{"aaxis":{"gridcolor":"#DFE8F3","linecolor":"#A2B1C6","ticks":""},"baxis":{"gridcolor":"#DFE8F3","linecolor":"#A2B1C6","ticks":""},"bgcolor":"white","caxis":{"gridcolor":"#DFE8F3","linecolor":"#A2B1C6","ticks":""}},"title":{"x":0.05},"xaxis":{"automargin":true,"gridcolor":"#EBF0F8","linecolor":"#EBF0F8","ticks":"","title":{"standoff":15},"zerolinecolor":"#EBF0F8","zerolinewidth":2},"yaxis":{"automargin":true,"gridcolor":"#EBF0F8","linecolor":"#EBF0F8","ticks":"","title":{"standoff":15},"zerolinecolor":"#EBF0F8","zerolinewidth":2}}},"xaxis":{"anchor":"y","domain":[0.0,1.0],"title":{},"visible":true,"ticklabelposition":"inside","tickangle":-90,"tickfont":{"family":"Serif","color":"black","size":22}},"yaxis":{"anchor":"x","domain":[0.0,1.0],"title":{},"visible":true,"showticklabels":true,"ticklabelposition":"inside","tickfont":{"family":"Serif","color":"black","size":22}},"legend":{"title":{"text":"family"},"tracegroupgap":0,"font":{"size":22},"bgcolor":"rgba(255,255,255,0.5)","x":0,"y":0,"xanchor":"left","yanchor":"top","orientation":"h"},"margin":{"t":0,"r":0,"l":0,"b":0},"barmode":"relative","font":{"family":"Serif","color":"black","size":24},"width":1000,"height":400}}